
def deck ()

    """
    Генератор, создающий колоду игральных карт в виде кортежей (номинал, масть).

    Каждая карта представлена кортежем, где:
    - первый элемент (int): номинал карты (от 2 до 14, где 11=Валет, 12=Дама, 13=Король, 14=Туз)
    - второй элемент (str): масть карты ('черви', 'бубны', 'пики', 'трефы')

    Возвращает:
        Iterator[Tuple[int, str]]: итератор по всем картам колоды
    """
    
    suit = ['черви','бубны','пики','трефы']
    for view in suit:
        for nominal  in range (2,15):
            yield(nominal,view)
            
            
# >>> list(deck())[::12]
# [(2, 'черви'), (14, 'черви'), (13, 'бубны'), (12, 'пики'), (11, 'трефы')]
# >>> list(deck())[::13]
# [(2, 'черви'), (2, 'бубны'), (2, 'пики'), (2, 'трефы')]
# >>> list(deck())[::13]
# [(2, 'черви'), (2, 'бубны'), (2, 'пики'), (2, 'трефы')]
# >>> list(deck())[::14]
# [(2, 'черви'), (3, 'бубны'), (4, 'пики'), (5, 'трефы')]
# >>> list(deck())[::15]
# [(2, 'черви'), (4, 'бубны'), (6, 'пики'), (8, 'трефы')]
# >>> list(deck())[::13]
# [(2, 'черви'), (2, 'бубны'), (2, 'пики'), (2, 'трефы')]
# >>>