integer_number = int(input('Введите целое число : '))


previous_number = integer_number - 1
next_number = integer_number + 1

# ИСПРАВИТЬ: вывод не соответствует требуемому формату
# ИСПРАВЛЕНО
# ИСПРАВИТЬ: согласно условию данной задачи, функция print() должна быть вызвана один раз
# ИСПРАВЛЕНО
print(f'Следующее за числом {integer_number} число: {next_number}\nДля числа {integer_number} предыдущее число: {previous_number}')



# Введите целое число : 44
# Следующее за числом 44 число: 45
# Для числа 44 предыдущее число: 43


# ИТОГ: 0/2

