# Импортирую  функцию из utils.py
from utils import important_message

# основная функция
def main():
    """
    будет спрашивать сообщение и выводить егов  рамках
    """
    
    # вопрос от системы пользователю
    user_text = input("текст сообщения: ")
    
    # обрамление текста
    framed_text = important_message(user_text)
    
    # пустые строки
    print('\n' + framed_text + '\n')
    
    # None 
    return None

# для импорта
if __name__ == "__main__":
    main()
    
    
#  C:\Users\Admin\Konev\2025.04.19>python -i 2.py
#текст сообщения: привет

#=====================================================================================================================#
#                                                                                                                     #
#                                                         привет                                                        #
#                                                                                                                     #
#=====================================================================================================================#

# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
# >>> msg = important_message(text)
# >>> print(msg)
#=====================================================================================================================#
#                                                                                                                     #
#            Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы           #
#                                                                                                                     #
#=====================================================================================================================#
# >>> main()
# текст сообщения:

#=====================================================================================================================#
#                                                                                                                     #
#                                                                                                                     #
#=====================================================================================================================#
