
-1. проверка подключенныз БД

mysql> SHOW DATABASES;
+---------------------------+---------------------------------------+
0.+ выбераю базу world

USE world;
+---------------------------+---------------------------------------+
1. Вывести названия всех стран Евразии

mysql> SELECT Name
    -> FROM country
    -> WHERE Continent IN ('Europe', 'Asia');
+---------------------------+---------------------------------------+
2. Вывести названия регионов и стран, в которых ожидаемая продолжительность жизни меньше пятидесяти лет

mysql> SELECT Region, Name
    -> FROM country
    -> WHERE LifeExpectancy < 50;
+---------------------------+---------------------------------------+
3. Вывести название самой крупной по площади страны Африки
mysql> SELECT Name
    -> FROM country
    -> WHERE Continent = 'Africa'
    -> ORDER BY SurfaceArea DESC
    -> LIMIT 1;
+-------+
| Name  |
+-------+
| Sudan |
+-------+
+---------------------------+---------------------------------------+

4. Вывести названия пяти азиатских стран с самой низкой плотностью населения

mysql> SELECT Name
    -> FROM country
    -> WHERE Continent = 'Asia'
    -> ORDER BY (Population / SurfaceArea) ASC
    -> LIMIT 5;
+---------------------------+---------------------------------------+

Запросы к таблице city

5. Вывести в порядке возрастания населения коды стран и названия городов, численность населения которых превышает пять миллионов человек

mysql> SELECT CountryCode, Name, Population
    -> FROM city
    -> WHERE Population > 5000000
    -> ORDER BY Population ASC;
+---------------------------+---------------------------------------+



6. Вывести название города в Индии с самым длинным названием

mysql> SELECT Name
    -> FROM city
    -> WHERE CountryCode = 'IND'
    -> ORDER BY CHAR_LENGTH(Name) DESC
    -> LIMIT 1;
+---------------------------+---------------------------------------+


     